{"Common Family": "Cocoa", "Type": "Tree", "Fruits Shape": "leaf like", "Description": "The genus Sterculia was named after the Latin god Sterculius. Stercus means dung. This name was given to this genus because of the foul-smelling flowers and leaves of some Sterculia species. Sterculia colorata is a medium-sized tree with spreading branches. It sheds leaves before the onset of flowering. After leaf-shedding, buds sprout and develop into flowers. The tree flowers from March­April. It produces flowers in short dense panicles which occur at the ends of the branches. The flowers are orange-red in colour and hang downwards. The flowering stalks together with flowers are covered with fine downy hairs giving the whole inflorescence a soft, velvety look. During flowering phase, Colored Sterculia is quite prominent and presents a brilliant sight because of its orange-red flowers against a leafless state. The flowers are large, 30 mm long. The flower tube is 13 ± 0.8 mm long, tubular at the base and lobed at the tip. Its rim is surrounded by white soft hair. The corolla looks like it is united inside with the tubular sepals at the base. From the centre of the calyx tube, a sta- minal column protrudes bearing at its summit 30 anthers. Scarlet Sterculia is common in the forests of the Western Ghats and the Deccan.", "Where": ["Entrance of Bal Bhavan, Cubbon Park, Bangalore"], "Grow Type": "Deciduous", "Name": "Scarlet Sterculia Tree", "Leaves Type": "Palmately lobed", "Fruits Color": "white", "Genus": "Firmiana", "Flowers Color": "orange red", "Wiki": "http://en.wikipedia.org/wiki/Firmiana_colorata", "Bark Color": "Pale grey brown", "Links": ["http://www.flowersofindia.net/catalog/slides/Scarlet%20Sterculia.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?101998", "http://www.theplantlist.org/tpl/record/kew-2812982"], "Family": "Sterculiaceae", "Authority": "(Roxb.) R. Br.", "Flowers Season": "Mar-Apr", "Images": ["Scarlet Sterculia Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "0024", "0025", "0026", "0027", "0028", "0029", "0030", "0031", "0032", "0033", "0034", "0035", "0036", "0037", "0038", "Bark", "Branch", "Canopy", "Flower Bunch", "Flower", "Leaf Falling", "Leaf"]], "Flowers Shape": "bell", "Native": ["S. E. Asia"], "Species": "colorata", "Size": "Medium"}
