{"Leaves Texture": "Feathery", "Common Family": "Pea", "Type": "Tree", "Leaflet Numbers": "3-7 pairs", "Description": "Large, handsome and spreading, the Rain Tree is easily recognised by its umbrella like canopy of evergreen, feathery foliage and puffs of pink flowers. It is frequently planted in groups or as an avenue because of its ability to keep its symmetrical conformation in spite of prevailing winds. It is a tree of rapid growth, brought originally from Central America to Sri Lanka and forwarded from there because it was considered to be a tree of great value for railway fuel. It often reaches a height of 27 m. and the strong, spreading branches may be nearly as long. The bark is dark grey, often bearing horizontal weals and the trunk frequently branches quite low down. From March to May and again towards the end of the year the green canopy is dotted all over with pink and white. During the rest of the year, too, there are usually quite a few flowers to be seen. The flowers appear like round, silken tufts, but actually each flower stalk bears one central and a surrounding circlet of florets, up to twenty in number. Each has a tube-shaped calyx and a tiny, yellow-lobed, crimson trumpet; bunches of long stamens, half pink and half white, protrude from each. The long, heavy leaves are twice pinnate and each pinna, of which there are four to eight pairs, bears from three to seven pairs of leaflets. These are oval and have no stalks, becoming larger and more curved towards the end. on its thickened base so that the leaves all lie sideways. In Malaysia this drooping of the leaves is considered to portend rain and is the explanation of the name Rain Tree, Hujan-hujan meaning \"rain\", but in India it is believed that the name was given because of a curious habit possessed by the tree of intermittently spraying the ground beneath with moisture. Later it was discovered that this was caused by multitudinous minute insects. The fruit is a fleshy pod, sweet to the taste and much relished by squirrels, horses and cattle.", "Where": ["double road, indiranagar, Bangalore"], "Grow Type": "Deciduous", "Sub Family": "Mimosoideae", "Fruits Season": "Dec", "Name": "Rain Tree", "Leaves Type": "bipinnate", "Fruits Shape": "Pod", "Leaves Staks": "4-8 pairs", "Genus": "Samanea", "Flowers Color": "pink and white", "Wiki": "http://en.wikipedia.org/wiki/Albizia_saman", "Bark Color": "greyish", "Links": ["http://www.flowersofindia.net/catalog/slides/Rain%20Tree.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?32979", "http://www.theplantlist.org/tpl/record/ild-32292"], "Family": "Fabaceae", "Locale": {"Common": ["Coco tamarind", "Acacia preta", "French tamarind", "Saman", "Monkey pod"]}, "Authority": "(Jacq.) Merr.", "Height": "27 m", "Flowers Season": "Mar-May", "Bark Texture": "rough", "Images": ["Rain Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "0024", "0025", "0026", "0027", "Bark", "Canopy Leaf", "Canopy Leafless", "Canopy", "Flower Bud", "Flower Bunch", "Flower", "Fruit Tender", "Fruit", "Leaf Tender", "Leaf"]], "Native": ["Central America"], "Species": "Saman", "Size": "Large"}
