"{\"Wiki\": \"http://en.wikipedia.org/wiki/Oriental_Magpie_Robin\", \"Name\": \"Oriental Magpie Robin\", \"Family\": \"Muscicapidae\", \"Where\": [\"Cubbon Park\"], \"Authority\": \"L.\", \"Images\": [\"Oriental Magpie Robin\", [\"0000\", \"0001\", \"0002\", \"0003\", \"0004\", \"0005\", \"0006\", \"0007\", \"Male\"]], \"Description\": \"This species is 19 centimetres (7.5 in) long, including the long tail that is usually held cocked upright. It is similar in shape to the smaller European Robin, but is longer-tailed. The male has black upperparts, head and throat apart from a white shoulder patch. The underparts and the sides of the long tail are white. Females are greyish black above and greyish white. Young birds have scaly brown upperparts and head. It is the national bird of Bangladesh.\\nThe nominate race is found on the Indian Subcontinent and the females of this race are the palest. The females of the Andamans race andamanensis are darker, heavier-billed and shorter-tailed. The Sri Lankan race ceylonensis (formerly included the Peninsular Indian populations south of the Kaveri River[2]) and southern nominate individuals have the females nearly identical to the males in shade. The eastern populations (Bhutan and Bangladesh) have more black on the tail and were formerly named erimelas.[3] The populations in Burma and further south are named as race musicus.[4] A number of other races have been named across the range including prosthopellus (Hong Kong), nesiotes, zacnecus, nesiarchus, masculus, pagiensis, javensis, problematicus, amoenus, adamsi, pluto, deuteronymus and mindanensis.[5] However many of these are not well marked and the status of some are disputed.[6] There is more geographic variation in the plumage of females than in that of the males.[7]\\nIt is mostly seen close to the ground, hopping along branches or foraging in leaf-litter on the ground with cocked tail. Males sing loudly from the top of trees or other high perches during the breeding season.\", \"Genus\": \"Copsychus\", \"Type\": \"Bird\", \"Species\": \"saularis\", \"Native\": \"India, S. E. Asia\"}"
