{"Common Family": "Palm", "Where": ["Krishna Temple Road, I stage, Indiranagar, Bangalore"], "Medicinal Uses": "Roots are cooling, restorative. Juice of plant is diuretic, stimulant, antiphlegmatic, useful in dropsy. Cabbage palm is native to the Americas.", "Leaves Size": "2 m", "Fruits Shape": "fig like", "Description": "Cabbage palm is a beautiful and versatile palm, is hence quite popular. It is recognized by its tan-gray, unbranched trunk, and large crown with fanlike leaves. The large leaves have a dull finish and are a medium green, sometimes yellow-green, in color depending on the individual and situation. Each leaf is up to 12 ft long overall including the spineless petioles (leaf stems) which measure about 5-6 ft in length. Leaves emerge directly from the trunk which is often covered with old leaf stem bases that are arranged in an interesting criss-cross pattern. Depending on the individual these may persist to the ground even in very old palms. Cabbage palm grows to a height of 10 - 25 m (32-82 feet), with a stem diameter of approximately 30 - 60 cm. In mid-summer the cabbage palm bears creamy white flowers on a long branched inflorescence that is held completely within the crown. Flowers are followed in late fall or early winter by black and fleshy spherical fruit that is about one third of an inch in diameter.", "Type": "Tree", "Grow Type": "Evergreen", "Name": "Cabbage Palm Tree", "Leaves Type": "fan", "Fruits Color": "green to black", "Genus": "Sabal", "Flowers Color": "Creamy", "Wiki": "http://en.wikipedia.org/wiki/Sabal_palmetto", "Bark Color": "Grey", "Links": ["http://www.flowersofindia.net/catalog/slides/Cabbage%20Palm.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?32594", "http://www.theplantlist.org/tpl/record/kew-181053"], "Family": "Arecaceae", "Locale": {"Common": ["Sabal palm", "Palmetto palm", "Cabbage palm"]}, "Authority": "(Walter) Lodd. ex Schult. & Schult. f.", "Height": "20m", "Flowers Season": "Mar-Apr, Nov-Dec", "Images": ["Cabbage Palm Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "Bark", "Canopy", "Flower Single", "Flower", "Fruit Falling", "Fruit Tender 1", "Fruit Tender 2", "Fruit", "Leaf"]], "Native": ["S. E. United States", "Cuba", "Bahamas"], "Species": "palmetto", "Size": "Medium"}
