{"galleryinfo": {"HID": 255, "HH": 5, "HN": 255, "HB": "Clerodendrum minahassae, Teijsm. & Binn.", "HC": 23, "gallery": "35,34,40,71,59,6,76,1,0000,0001,0002,0003,0004,0005,0006,0007,0008,0009,0010,0011,0012,0013,0014"}, "cardinfo": [{"CN": 6, "CV": [{"N": 19, "V": [1, 5, 255]}, {"N": 32, "V": [1, 3, 0]}, {"N": 7, "V": [0, "", "Lamiaceae"]}, {"N": 8, "V": [0, "", "Clerodendrum"]}, {"N": 26, "V": [0, "", "minahassae"]}, {"N": 2, "V": [0, "", "Teijsm. & Binn."]}, {"N": 4, "V": [0, "", "Clerodendrum"]}, {"N": 25, "V": [1, 2, 2]}, {"N": 9, "V": [1, 1, 0]}], "CI": "Clerodendrum - Tube Flower Tree/Tube Flower Tree - Canopy.jpg"}, {"CN": 9, "CV": [{"N": 17, "V": [0, "", "<a href=\"http://en.wikipedia.org/wiki/Clerodendrum_minahassae\" target=\"_blank\">wikipedia</a><br /><a href=\"http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?182\" target=\"_blank\">ars-grin</a><br /><a href=\"http://www.theplantlist.org/tpl/record/kew-42844\" target=\"_blank\">theplantlist</a>"]}, {"N": 6, "V": [0, "", "Tube Flower - is one of the most desirable of the Clerodendrum species. It wants to grow as a tall shrub, but it can also be easily trimmed in to a tree shape. All Clerodendrums have the nasty habit of producing root suckers. Some species are so prolific at this that they can take over an entire garden in one growing season. Clerodendrum minahassae is one of the more tame species when it comes to suckering. The few suckers that it does produce can easily be pulled out by hand, or cut off with the lawn mower. The one exception to this is if the plant receives heavy pruning, either intentionally, or by storm damage. Then, as a survival tactic, it will produce many suckers.  Clerodendrum minahassae is almost an evergreen plant. It will retain its leaves year around, with the exception of a few weeks in late winter or early spring. Then it tends to drop most of its leave all at once, but puts out new growth almost immediately. It will grow to a large shrub or small tree of around 15 feet. It can be trimmed to a smaller size if desired, but trimming will initiate more root suckers.  Clerodendrum minahassae will bloom off and on at almost any time of the year. The heaviest bloom however is in the spring, with a complete cover of white tube shaped flowers. Heavy flowering last a short time, from a few weeks to a little over a month. But the flowers quickly produce seeds which are very striking. Each flower produces a single seed pod which starts out a light green, then turns to a deep, glossy black over time. The seed pod is surrounded by a large, brilliant red halo. The seed pods, with the brilliant red halo hangs on the plant for many months providing a very interesting display of color. These pictures simply does not do the tree justice.  Clerodendrum minahassae will do best in full sun, although it doesn't mind being in an area of partial shade. It is not fussy about soil conditions, and can tolerate almost and type. It will require regular watering until it has become established. Then it is moderately draught resistant. It is a tropical plant and will be damaged at temperatures below freezing."]}, {"N": 20, "V": [0, "", ["Indonesia", "Philippines"]]}]}, {"CN": 0, "CV": [{"N": 3, "V": [1, 0, 5]}], "CI": "Clerodendrum - Tube Flower Tree/Tube Flower Tree - Bark.jpg"}, {"CN": 3, "CV": [{"N": 3, "V": [1, 0, 10]}, {"N": 21, "V": [0, "", "Aug-Sep"]}], "CI": "Clerodendrum - Tube Flower Tree/Tube Flower Tree - Flower.jpg"}, {"CN": 4, "CV": [{"N": 3, "V": [1, 0, 9]}, {"N": 11, "V": [0, "", "Color: green to red"]}], "CI": "Clerodendrum - Tube Flower Tree/Tube Flower Tree - Fruit.jpg"}, {"CN": 8, "CV": [{"N": 32, "V": [1, 4, 11]}], "CI": "Clerodendrum - Tube Flower Tree/Tube Flower Tree - Leaf.jpg"}], "mapinfo": [{"lat": "12.94755736", "long": "77.58445551"}, {"lat": "12.9475852836", "long": "77.5844844926"}, {"lat": "12.97573622035364", "long": "77.61673061152703"}, {"lat": "12.963285317409536", "long": "77.6446454135147"}], "mapregion": [["12.94755736", "77.58445551"], ["12.97573622035364", "77.6446454135147"]]}
