{"Common Family": "Voacanga", "Leaves Size": "30 cm", "Description": "Voacanga africana is a small tropical African tree that grows to 6m in height. It has leaves that are up to 30 cm in length, and the tree produces yellow or white flowers, which become berries with yellow seeds. Voacanga Africana is an evergreen shrub native to Western Africa, specifically Ghanaand Ivory Coast. The plant is widely distributed over the secondary forest and transitionalzones.The tree is between 10-30 feet tall with white or yellow flowers. The seeds arenumerous, dark brown and ellipsoid in shape, embedded in pulp.It is mostly found in the wild and as a shade plant around communities but occasionallycultivated on commercial basis in certain parts of Ghana. The plant is distributed over the southern and the middle belt of the country. Very high concentrations exist in Agona.Asikuma, Ejumako, Assin, and Abura-Asebu districts of the central region; Birim Southand Fanteakwa districts of the Eastern Region: Amansie East and Effiduasi districts of Ashanti Region: Sunyani and Dormaa districts of the Brong Ahafo region; and Wassa-Amenfi district of the western region.The plant flowers in May and fruits mature in July.", "Flowers Color": "white", "Grow Type": "Evergreen", "Fruits Info": "Poisonous", "Name": "Akan Tree", "Leaves Type": "oval", "Fruits Color": "green sprinkled with white", "Genus": "Voacanga", "Where": ["Close to main entrance, Lalbagh, Bangalore"], "Wiki": "http://en.wikipedia.org/wiki/Voacanga_africana", "Bark Color": "Grey", "Type": "Tree", "Links": ["http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?451655", "http://www.theplantlist.org/tpl/record/kew-213939"], "Family": "Apocynaceae", "Authority": "Stapf.", "Height": "6 m", "Flowers Season": "Apr-May", "Images": ["Akan Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "Bark", "Branch", "Canopy Leaf", "Canopy", "Flower Bud", "Flower Bunch", "Flower SIngle", "Flower", "Fruit Falling", "Fruit Seed", "Fruit", "Leaf Falling", "Leaf"]], "Native": "Africa", "Species": "africana", "Size": "Small"}
