{"Wiki": "http://en.wikipedia.org/wiki/Intsia_bijuga", "Bark Color": "brown", "Fruits Shape": "Pod", "Common Family": "Pea", "Name": "Borneo Teak tree", "Family": "Fabaceae", "Leaves Type": "oval", "Flowers Color": "White", "Grow Type": "Evergreen", "Links": ["http://www.flowersofindia.net/catalog/slides/Borneo%20Teak.html"], "Authority": "(Colebr.) Kuntze", "Where": ["Lalbagh, Bangalore"], "Size": "Medium", "Flowers Season": "Mar", "Images": ["Borneo Teak Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "0024", "0025", "Bark", "Branch", "Canopy", "Flower Bud 1", "Flower Bud 2", "Flower Bunch", "Flower", "Fruit", "Leaf New", "Leaf Tender", "Leaf"]], "Description": "General: Family (Leguminoseae). Ifit is a medium to large, slow growing, evergreen tree. At maturity, it ranges in height from 7 to 45 m tall, but rarely exceeds 25 m in Guam. The trunk is usually 0.5 to 5m, crooked, and often buttresses at the base. The buttresses are formed by woody roots expanding vertically creating radial walls extending from the sides of the trunk . The rooting system allows the tree to cover large areas containing rocks and thin soil, reduce competition, and increase its resistance to uprooting during cyclones.  The wood is strong and reddish brown with the heartwood yellow to orange brown. It has a high resistance to attacks by termites. Aging bark is red or bronze. The bark contains tannins, and a dye can be extracted from both the wood and bark.  The crown in full sunlight is usually upright, however, under shady conditions the crown will spread. The alternate compound leaves are 7-15 cm long, with 1-2 pairs of opposite, broadly elliptic to subrotund dark green coriaceous leaflets, each about 8-12 cm long and 5-8 cm wide on short petiolules, apex obtuse, and slightly symmetric sides.  Flowers grow in puberulent, terminal clusters of corymbose panicles, 6-10 cm long. Single petals are white, or slightly pinkish, with three stamens. The filaments are about 2.5 cm long.  The fruit are long, thick, rigid, leathery, oblong or pear-shaped green pods up to 30 cm long and 10 cm wide, which become dark brown at maturity. Each pod can contain 2 to 8 seeds varying in size and shape from round to slightly kidney shape.  Distribution: Ifit is native from the Indian Ocean eastward to Polynesia. It is found throughout American Samoa, Australia, Burma, Cambodia, India, Indonesia, Madagascar (at low altitudes in the west), Malaysia, Myanmar, Pacific Islands, Papua New Guinea, Philippines, Seychelles, Tanzania, Thailand, and Vietnam.", "Genus": "Intsia", "Type": "Tree", "Species": "bijuga", "Native": ["S. E. India"]}
