{"Leaves Shed": "Feb", "Spines Info": "Solitary", "Common Family": "Citrus", "Where": ["Someshwara Temple, Ulsoor, Bangalore", "Bull Temple, Basavangudi, Bangalore", "Jogpalya Main Road, Jogpalya, Bangalore"], "Type": "Tree", "Leaflet Numbers": "3", "Bark Info": "Corky", "Description": "Bel is a fruit-bearing tree which is cultivated throughout India, as well as in Sri Lanka, northern Malaya, Java and in the Philippines. The tree, which is the only species in the genus Aegle, grows up to 15 meters tall and bears thorns and fragrant flowers. Leaves are alternate, pale green, trifoliate; terminal leaflet, 5.7 cm long, 2.8 cm broad, having a long petiole; the two lateral leaflets, almost sessile, 4.1 cm long, 2.2 cm wide, ovate to lanceolate having reticulate pinnate venation; petiole, 3.2 cm long. Flowers, greenish white, sweetly scented, bisexual, stalked; stalk, 8 mm long; diameter of a fully open flower is 3 cm; flowers, borne in lateral panicles of about 10 flowers, arising from the leaf axils. It has a woody-skinned, smooth fruit 5-15 cm in diameter. The skin of some forms of the fruit is so hard it must be cracked open with a hammer. It has numerous seeds, which are densely covered with fibrous hairs and are embedded in a thick, gluey, aromatic pulp. The fruit is eaten fresh or dried. The juice is strained and sweetened to make a drink similar to lemonade, and is also used in making Sharbat. is a sacred tree, dedicated to Lord Shiva. The offering of bael leaves is a compulsory ritual of the worship of Lord Shiva in the hills. This importance seems largely due to its medicinal properties. All parts of this tree, viz., root, leaf, trunk, fruit and seed, are used for curing one human ailment or another.", "Language Hindi": "Bael, bel, bil, beel, bila, sirphal", "Grow Type": "Deciduous", "Language Common": "Bel, Beli fruit, Bengal quince, Stone apple, golden apple", "Spines Shape": "Straight", "Spines Size": "2.5 cm", "Name": "Vilvam Tree", "Leaves Type": "Trifoliate", "Fruits Shape": "Globose", "Fruits Size": "Large", "Fruits Color": "Green turning Orange", "Genus": "Aegle", "Flowers Color": "creamy", "Wiki": "http://en.wikipedia.org/wiki/Bael", "Bark Color": "Pale", "Links": ["http://www.flowersofindia.in/catalog/slides/Bel.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?1560", "http://www.theplantlist.org/tpl/record/kew-2623456"], "Family": "Rutaceae", "Flowers Size": "3 cm", "Authority": "(L.) Correa", "Height": "18 m", "Flowers Season": "Mar-Apr", "Bark Texture": "Shallow Furrows", "Images": ["Vilvam Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "Bark", "Canopy", "Flower Bud", "Flower", "Fruit", "Leaf Tender", "Leaf", "Spine"]], "Native": "S. E. Asia, India", "Flowers Info": "4 or 5 petals, Fragrant", "Species": "Marmelos", "Size": "Medium"}
