{"Common Family": "ZZFamily", "Type": "Tree", "Fruits Shape": "Pod", "Description": "Pride of Burma is a tropical tree with exceptionally beautiful flowers. It is also known as the Orchid Tree, a name otherwise reserved for members of the genus Bauhinia. The extravagant flowers are seen hanging from the long inflorescence, or flower stalk, which is a bright crimson red at the end. There are 5 petals although 2 of these are minute and the rest are of unequal size. The petals are also crimson; the two medium sized petals are yellow at the tip and the largest petal is broad and fan-shaped with a wavy upper margin and a yellow triangle of colour extending from the lip down into the flower. This large petal may be 7.5 cm long and over 4 centimetres wide at the end. There are either 9 or 10 stamens, 9 of which are partially fused into a pink sheath; the stamens are of two differing lengths with the longer ones having larger anthers. The compound leaves bear 6 - 8 large leaflets; these are broadly oblong in shape and are a whitish colour underneath. The fruits, or seedpods, are 11-20 cm long. They are roughly scimitar-shaped and the woody outer case opens to disperse the seeds. Pride of Burma is very rare in the wild and has only been collected in native habitat a few times. It is native to Burma (Myanmar) hence the common name.", "Where": ["Lalbagh, Bangalore"], "Grow Type": "Evergreen", "Sub Family": "Caesalpinioideae", "Name": "Pride Of Burma Tree", "Leaves Type": "paripinnate", "Fruits Color": "green to red yellow", "Genus": "Amherstia", "Flowers Color": "crimson", "Wiki": "http://en.wikipedia.org/wiki/Amherstia_nobilis", "Bark Color": "grey", "Links": ["http://www.flowersofindia.in/catalog/slides/Pride%20of%20Burma.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?2893", "http://www.theplantlist.org/tpl/record/ild-30608"], "Family": "Fabaceae", "Authority": "Wall.", "Flowers Season": "Feb-Mar", "Images": ["Pride Of Burma Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "0024", "0025", "0026", "0027", "0028", "0029", "0030", "0031", "0032", "0033", "0034", "Bark", "Branch", "Canopy", "Flower Bud 1", "Flower Bud 2", "Flower Single", "Flower", "Fruit", "Leaf Tender 1", "Leaf Tender 2", "Leaf"]], "Native": "Burma", "Species": "nobilis", "Size": "Medium"}
