{"Common Family": "Ghalab", "Type": "Tree", "Fruits Shape": "round", "Description": "Conocarpus lancifolius, one of two species in the genus Conocarpus, is a tree in the family Combretaceae native to coastal and riverine areas of Somalia, Djibouti, and Yemen. It is found throughout East Africa, the Arabian peninsula, and South Asia. The tree has no common name in English. In Somali, it is called ghalab; in Arabic, the name is damas.Commonly found in residential compounds in Dubai UAE. The tree's wood is dense and suitable for charcoal. Goats use the young trees and shoots as fodder, although the leaves contain tannin. Because of its high salt tolerance and relative drought tolerance, the tree is sometimes planted as a pioneer species in reafforestation projects in its native habitat. The tree has a symmetrical growth habit and can easily be shaped into a variety of different forms. It can be shaped into short and tall hedges, and is effective for creating a visual or a noise barrier. With suitable plant spacing it can also be grown as a hardy single-stemmed tree which is good for shade. The tree has been extensively used in Karachi for landscaping along roads and by homeowners as a tall hedging tree for screening purposes. The tree thrives exceptionally well in the hot and dry climate of the city.", "Where": ["13th main road, 100ft road, indiranagar, Bangalore"], "Grow Type": "Evergreen", "Name": "Ghalab  Tree", "Leaves Type": "oval", "Fruits Size": "1 cm", "Fruits Color": "creamy white", "Genus": "Conocarpus", "Flowers Color": "creamy white", "Wiki": "http://en.wikipedia.org/wiki/Conocarpus_lancifolius", "Bark Color": "brown", "Links": ["http://www.theplantlist.org/tpl/record/kew-2734524:$"], "Family": "Combretaceae", "Flowers Size": "small", "Authority": "Engl.", "Flowers Season": "Jun-Aug", "Images": ["Ghalab Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "0024", "0025", "0026", "0027", "Bark", "Branch", "Canopy", "Flower Bud 2", "Flower Bunch", "Flower", "Fruit Falling", "Fruit Tender 1", "Fruit Tender 2", "Fruit", "Leaf Tender", "Leaf"]], "Native": "Somalia", "Species": "lancifolius", "Size": "Medium"}
