{"Common Family": "dovyalis", "Type": "Tree", "Fruits Shape": "round", "Description": "Dovyalis caffra Warb., the Umkokola, or Kei apple, is a small to medium-sized tree, native to southern Africa. Its distribution extends from the Kei River in the south, from which the common name derives, northwards along the eastern side of the continent to Tanzania. The ripe fruits are tasty, reminiscent of a small apple.  It is a usually found in dry types of woodland when it grows to 6 m tall. In moister types of open woodland it reaches its greatest size of about 8–9 metres. It is a rather straggly tree, with sharp, 3–6 cm long stem spines in the leaf axils. Buds at the base of the spine produce clusters of alternately arranged simple ovate leaves 3–6 cm long.  The flowers are inconspicuous, solitary or clustered, with no petals. It is dioecious, with male and female flowers on separate plants, though some female plants are parthenogenetic.  The fruit is an edible bright yellow or orange globose berry 2.5–4 cm diameter, with the skin and flesh of a uniform colour and containing several small seeds. Production is often copious, weighing down the branches during the summer. They are juicy, tasty and acidic.", "Where": ["Lalbagh, Bangalore"], "Grow Type": "Deciduos", "Spines Color": "White", "Spines Shape": "straight", "Name": "Kei Apple Tree", "Leaves Type": "oval", "Fruits Color": "green to orange", "Genus": "Dovyalis", "Flowers Color": "green", "Wiki": "http://en.wikipedia.org/wiki/Dovyalis_caffra", "Bark Color": "grey", "Links": ["http://www.flowersofindia.net/catalog/slides/", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?14616", "http://www.theplantlist.org/tpl/record/tro-100326513"], "Family": "Salicaceae", "Authority": "(Hook. f. & Harv.) Warb.", "Height": "9m", "Images": ["Kei Apple Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "Bark", "Branch", "Canopy", "Leaf New", "Leaf Tender", "Leaf", "Spine Tender", "Spine"]], "Native": ["S. Africa"], "Species": "caffra", "Size": "Small"}
