{"Leaves Texture": "Feathery", "Common Family": "Cashew", "Type": "Tree", "Fruits Shape": "kidney", "Bark Info": "Shallow cracks", "Description": "It is a matter of astonishment to many that the delicious mango, one of the most celebrated of Indian fruits, is a member of the family Anacardiaceae notorious for embracing a number of highly poisonous plants. The mango tree is erect, 30 to 100 ft high, with a broad, rounded canopy which may, with age, attain 100 to 125 ft in width, or a more upright, oval, relatively slender crown. In deep soil, the taproot descends to a depth of 20 ft, the profuse, wide-spreading, feeder root system also sends down many anchor roots which penetrate for several feet. The tree is long-lived, some specimens being known to be 300 years old and still fruiting. Nearly evergreen, alternate leaves are borne mainly in rosettes at the tips of the branches and numerous twigs from which they droop like ribbons on slender petioles 1 to 4 in long. Hundreds and even as many as 3,000 to 4,000 small, yellowish or reddish flowers, 25% to 98% male, the rest hermaphroditic, are borne in profuse, showy, erect, pyramidal, branched clusters 2 1/2 to 15 1/2 in high. There is great variation in the form, size, color and quality of the fruits. They may be nearly round, oval, ovoid-oblong, or somewhat kidney-shaped, often with a break at the apex, and are usually more or less lop-sided.", "Where": ["7th main road, II Stage, indiranagar, Bangalore"], "Grow Type": "Semi Evergreen", "Fruits Info": "Edible", "Name": "Mango Tree", "Fruits Texture": "Smooth", "Leaves Type": "ovate", "Leaves Color": "orange ping to red to glossy green", "Fruits Size": "big", "Fruits Color": "Green to yellow", "Genus": "Mangifera", "Flowers Color": "yellowish green", "Wiki": "http://en.wikipedia.org/wiki/Mango", "Bark Color": "Grey brown", "Links": ["http://www.flowersofindia.in/catalog/slides/Mango.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?23351", "http://www.theplantlist.org/tpl/record/kew-2362842"], "Family": "Anacardiaceae", "Leaves Info": "Young leaves pink or purple", "Authority": "L.", "Height": "35-40m", "Flowers Season": "Jan-Mar", "Bark Texture": "rough", "Images": ["Mango Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "Bark", "Canopy", "Flower", "Fruit New", "Fruit Tender", "Fruit", "Leaf Tender 1", "Leaf Tender 2", "Leaf"]], "Flowers Shape": "panicles", "Native": "India", "Species": "Indica", "Flowers Size": "10-40 cm", "Size": "Medium"}
