{"Common Family": "Jacaranda", "Type": "Tree", "Fruits Shape": "Pod", "Bark Info": "peeling off to show yellowish patches", "Description": "Stereospermum kunthianum is a deciduous shrub or tree, 3-15 m high, with a stem diameter of 25 cm; bark thin, grey to grey-black, smooth or flakes off in patches resembling the European plane tree; trunk rarely straight, mostly forked; branches twisted; branching is erect and spreading to form a light, rounded crown. Slash white or light brown. Leaves imparipinnately compound, 25 cm long, alternate with 2-4 (max. 6) almost opposite pairs of leaflets and 1 terminal leaflet; 5-9 leaflets with short, soft hairs, oblong to oblong elliptic, stiff, 5-8(max. 10) x 3-7.5 cm, green and hairless above and yellow-green with prominent veins under; apex broadly tapering, often abruptly attenuate; base tapering; margin entire, occasionally toothed in coppice growth; petiolules almost absent; petiole up to 7 cm long, caniculate at the top; young leaves sometimes toothed and hairy. Flowers precocious, fragrant, bisexual, showy, mauve to off-white, more usually pinkish with red streaks on the lower corolla lobes and produced in large, drooping panicles on long peduncles; corolla with a tube up to 3 cm long and spreading lobes, 3-4 cm in diameter; calyx bell shaped, irregularly 2- to 5-lobed, partially forming 2 lips; stamens 4, enclosed within the corolla tube; ovary linear-oblong, 2-chambered. Fruits slender, flat capsules or paired pods up to 45 x 1 cm, cylindrical, greenish-purple, reddish-brown to dark brown, pendulous, spirally twisted, smooth, splitting into 2 valves to release many flat, long, narrow, winged seeds. The remnants of the capsule remain on the tree for months.", "Where": ["Lalbagh, Bangalore"], "Grow Type": "Deciduous", "Name": "Pink Jacaranda Tree", "Leaves Type": "imparipinnate", "Fruits Size": "35-50cm", "Genus": "Stereospermum", "Flowers Color": "pink", "Wiki": "http://en.wikipedia.org/wiki/Stereospermum_kunthianum", "Bark Color": "brown", "Links": ["http://www.flowersofindia.in/catalog/slides/", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?35567", "http://www.theplantlist.org/tpl/record/kew-318261"], "Family": "Bignoniaceae", "Authority": "Cham.", "Height": "3-15m", "Leaflet Terminal": "odd", "Flowers Season": "Mar", "Images": ["Pink Jacaranda Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "0024", "0025", "0026", "0027", "0028", "0029", "0030", "0031", "0032", "0033", "0034", "0035", "0036", "0037", "0038", "0039", "0040", "0041", "Bark", "Branch", "Canopy Leaf", "Canopy", "Flower Bud", "Flower Single", "Flower", "Fruit Falling", "Fruit", "Leaf"]], "Native": "Africa", "Species": "kunthianum", "Size": "Medium"}
