{"Common Family": "Marijuana", "Type": "Tree", "Fruits Shape": "oval", "Description": "ndian charcoal tree is a fast-growing shade tree with soft foliage. Depending on climatic conditions, trees may be evergreen or deciduous. In forests it is a straight, slender tree, up to 18 m on forest margins, and in the open it is wider-spreading, sometimes drooping, and in dry areas it often grows as a shrub approximately 3 m tall. The less water it receives, the shorter it is. Trema bark is smooth and light grey with conspicuous lenticels (corky spots). The leaves are simple, alternate, stipulate although the stipules drop early, and usually 3-nerved from the base. The leaf base is frequently unequal. Leaves taper from the base to the apex, and vary from 60 to 150 mm long and 25 to 50 mm wide. Leaf margins are finely serrated, and the young leaves are rough and hairy, occasionally becoming smooth when old. Flowers are small, inconspicuous and greenish, carried in short dense bunches. They are usually unisexual, i.e. male and female are separate, occasionally they are found together. Flowers appear irregularly from late winter to summer. The name Trema is based on the Greek word for hole and pertains to the pitted stone of the fruit. The common name pigeon wood is derived from the fact that pigeons are frequently seen nesting or roosting in these trees.", "Where": ["Kalasa, Karnataka"], "Grow Type": "Deciduous", "Name": "Indian Charcoal Tree", "Leaves Type": "oval", "Fruits Size": "Small", "Fruits Color": "green", "Genus": "Trema", "Flowers Color": "white", "Wiki": "http://en.wikipedia.org/wiki/Trema_orientalis", "Bark Color": "yellowish grey", "Links": ["http://www.flowersofindia.net/catalog/slides/Indian%20Charcoal%20Tree.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?40045", "http://www.theplantlist.org/tpl/record/kew-2518675"], "Family": "Cannabaceae", "Authority": "(L.) Blume", "Height": "3-10 m", "Flowers Season": "Apr-May", "Bark Texture": "smooth", "Images": ["Indian Charcoal Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "Bark", "Branch", "Canopy", "Flower Male", "Flower", "Fruit", "Leaf Tender", "Leaf"]], "Native": ["India"], "Species": "orientalis", "Size": "Small"}
