{"Wiki": "http://en.wikipedia.org/wiki/Cepora_nerissa", "Name": "Common Gull", "Family": "Pieridae", "Where": ["Everywhere"], "Authority": "Fabricius", "Images": ["Common Gull", ["Adult"]], "Description": "Male upperside: white, a greyish-blue shade at base of wings and along the veins, due to the dark markings on the underside that show through. Fore wing: veins black; apex and termen black, the inner margin of that colour extended in an irregular curve from middle of costa to base of terminal third of vein 4, thence continued obliquely outwards to the tornal angle; interspaces 6 and 9 with short narrow greyish-white streaks of the ground-colour that stretch into the black apical area but do not reach the margin; a short black subterminal bar between veins 3 and 4 and another, less clearly defined, between veins 1 and 2. Hind wing: veins 4 to 7 with outwardly-dilated broad black edgings that coalesce sometimes and form an anterior, irregular, black, terminal margin to the wing. Underside, fore wing: white, the veins broadly margined on both sides by dusky black; costal margin broadly and apex suffused with yellow; subterminal black bars between veins 1 and 2, and 3 and 4 as on the upperside but less clearly defined. Hind wing entirely suffused with yellow, the veins diffusely bordered with black; a more or less incomplete, subterminal series of dusky spots in interspaces 1 to 6; more often than not the spot in 5 entirely absent; a conspicuous chrome-yellow spot on the precostal area. Antennae black, obscurely speckled with white; head and thorax bluish grey; abdomen dusky black; beneath: the palpi and abdomen white, the thorax yellow. Female similar to the male but very much darker. Upperside: veins more broadly bordered with black; in many specimens only the following portions of the white ground-colour are apparent:—Fore wing: a broad streak in cell and beyond it a discal series of streaks in interspaces 1 to 6, 9 and 10; the streaks in interspaces 1 and 3 very broadly interrupted by the transverse black bars ; that in 6 more or less obsolescent. Hind wing: a broad streak in cell, a discal series of streaks in interspaces 2 to 7, and a posterior more or less obsolescent subterminal series of greyish-white double spots. Underside similar to that of the male only the veins much more broadly margined with diffuse black scaling. Antennae, head, thorax and abdomen as in the male.", "Genus": "Cepora", "Type": "Butterfly", "Species": "nerissa", "Native": ["India"]}
