{"Common Family": "Wood sorrel", "Authority": "L.", "Type": "Tree", "Leaflet Numbers": "8-20 pairs", "Description": "The bilimbi tree is long-lived, reaches 5-10 m in height. Its trunk is short and quickly divides up into ramifications. Bilimbi leaves, 30-60 cm long, are alternate, imparipirmate and cluster at branch extremities. There are around 11 to 37 alternate or subopposite oblong leaflets. This Carambola relative produces very small pickle-like fruits which are borne directly on the trunk of the tree and also on the branches. The fruits are preceded by small red flowers on the trunk and branches. Its flowers, like its fruits, are found in hairy panicles that directly emerge from the trunk as well as from the oldest, most solid branches. The yellowish or purplish flowers are tiny, fragrant and have 5 petals. The bilimbi fruit's form ranges from ellipsoid to almost cylindrical. Its length is 4-10 cm. The bilimbi is 5-sided, but in a less marked way than the carambola. If unripe, it is bright green and crispy. It turns yellowish as it ripens. The flesh is juicy, green and extremely acidic. The fruit's skin is glossy and very thin. The bilimbi is too acid for eating raw but the green uncooked fruits are prepared as a relish in Suriname. Originated seemingly from the Moluccas, in India, where it is usually found in gardens, the bilimbi has gone wild in the warmest regions of the country.", "Where": ["17th Cross Road, 4th Main Road, I Stage, Indiranagar, Bangalore"], "Grow Type": "Evergreen", "Name": "Cucumber Tree - Bilimbi", "Leaves Type": "paripinnate", "Fruits Color": "green", "Genus": "Averrhoa", "Flowers Color": "red", "Wiki": "http://en.wikipedia.org/wiki/Averrhoa_bilimbi", "Bark Color": "brown", "Links": ["http://www.flowersofindia.net/catalog/slides/Bilimbi.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?6157", "http://www.theplantlist.org/tpl/record/kew-2666745"], "Family": "Oxalidaceae", "Locale": {"Common": ["Bilimbi", "Cucumber-tree"]}, "Medicinal Uses": "In Malaysia the leaves of bilimbi are used as a treatment for venereal disease. A leaf decoction is taken as a medicine to relieve rectal inflammation. It seems to be effective against coughs and thrush.", "Flowers Season": "Feb-Apr", "Images": ["Cucumber Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "Bark Young", "Bark", "Branch", "Canopy", "Flower Bunch", "Flower Single", "Flower", "Fruit New", "Fruit Tender", "Fruit", "Leaf Tender", "Leaf"]], "Native": ["India"], "Species": "bilimbi", "Size": "Medium"}
