{"Wiki": "http://en.wikipedia.org/wiki/Euploea_core", "Name": "Common Indian Crow", "Family": "Nymphalidae", "Where": ["Everywhere"], "Authority": "Cramer", "Images": ["Common Indian Crow", ["0000", "0001", "0002", "0003", "0004", "0005", "Adult"]], "Description": "The Common Crow (Euploea core) is a glossy black butterfly with brown underside with white marks along the outer margins of the wing. The wingspan is about 8–9 cm and the body also has prominent white spots.  Upperside dark brown, broadly paler along terminal margins; Fore and hind wing with subterminal and terminal series of white spots; on fore wing the former more or less oval, curved inwards opposite apex, the latter series often incomplete, not reaching apex, the spots smaller; often there is a small costal spot, and very rarely a spot in apex of cell and one or more discal spots; on the hind wing the inner series of spots are elongate, the outer conical. Underside similar, but ground-colour more uniform; cell, costal and discal spots on both fore and hind wing nearly always present.[1] Race godarti (=E. godarti) (Northeast India and Myanmar) E. godarti Fore wing subtriangular, tornus more rounded than in E. core. Hindwing broadly ovate. Upperside dark brown, broadly paler along the terminal margins, especially on the fore wing. Fore wing with more or less incomplete and obsolescent series of subterminal and terminal small white spots, and a powdering of violaceous-white scales at apex, varying very considerably in extent from a mere trace of violaceous between the veins to a large and very conspicuous patch occupying the whole of the apex. Hind wing with a subterminal series of oval or inwardly conical and terminal series of more rounded white spots. Underside paler brown, the white spots larger, more clearly defined. Fore wing not violaceous at apex, a spot (sometimes absent) in apex of cell, and two or three discal spots. Hindwing: a spot in apex of cell, also sometimes absent, and a discal series of five small spots beyond. Antennae, head, thorax and abdomen very dark brown, and, the antennae excepted, sparsely spotted with white.[1]", "Genus": "Euploea", "Type": "Butterfly", "Species": "core", "Native": "S. Asia"}
