{"Common Family": "Palm", "Where": ["Lalbagh, Bangalore"], "Leaves Size": "3 m", "Leaflet Numbers": "15-20", "Description": "The Queen Palm is found in most tropical and subtropical areas. It's very popular as an ornamental tree and much used in urban landscaping. However, the fronds die early and must be pruned to keep the tree visually pleasing. The sheaths of the pruned fronds remain on the tree for several months and are an ideal breeding place for snails and caterpillars. Its leaves and inflorescences are used as cattle fodder, specially for milking cows. Its fruits are edible, being sought by birds, as well as by mammals, including some wild canids, such as the Pampas Fox[2] and the Crab-eating Fox. Syagrus romanzoffiana (Queen Palm or Cocos Palm) is a palm native to South America, from northern Argentina north to eastern Brazil and west to eastern Bolivia. It is very similar to the coconut palm. It had been classified within the Cocos genus as Cocos plumosa, was assigned to Arecastrum, then moved to Syagrus. As a result of the nomenclature confusion, they often retain a previous, incorrect name in popular usage. It is a medium-sized palm, quickly reaching maturity at a height of up to 15 metres tall, with pinnate leaves.  The Queen Palm is found in most tropical and subtropical areas. It's very popular as an ornamental tree and much used in urban landscaping. However, the fronds die early and must be pruned to keep the tree visually pleasing. Its leaves and inflorescences are used as cattle fodder, specially for milking cows. Its fruits are edible, being sought by birds, as well as by mammals, including some wild canids, such as the Pampas Fox[2] and the Crab-eating Fox.[3] The fruits consist of a hard nut surrounded with a thin layer of fibrous flesh that is orange and sticky when ripe. The flavor is sweet and could be described as a mixture of plum and banana.", "Type": "Tree", "Grow Type": "Evergreen", "Name": "Queen Palm Tree", "Leaves Type": "paripinnate", "Fruits Shape": "olive like", "Language Latin": "Cocos plumosa", "Fruits Color": "green turning red", "Genus": "Syagrus", "Flowers Color": "Creamy Yellow", "Wiki": "http://en.wikipedia.org/wiki/Syagrus_romanzoffiana", "Bark Color": "Pale grey", "Links": ["http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?103123", "http://www.theplantlist.org/tpl/record/kew-198839"], "Family": "Arecaceae", "Authority": "(Cham.) Glassman", "Height": "15m", "Flowers Season": "Jun, Dec", "Images": ["Queen Palm Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "Bark", "Canopy", "Flower", "Fruit Tender", "Fruit", "Leaf"]], "Native": "Argentina", "Species": "romanzoffiana", "Size": "Medium"}
