{"Wiki": "http://en.wikipedia.org/wiki/Morus_alba", "Bark Color": "grey", "Common Family": "Mulberry", "Name": "White Mulberry Tree", "Family": "Moraceae", "Leaves Type": "ovate", "Flowers Color": "creamy", "Grow Type": "Deciduos", "Links": ["http://www.flowersofindia.net/catalog/slides/White%20Mulberry.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?24607", "http://www.theplantlist.org/tpl/record/kew-2501381"], "Authority": "L.", "Where": ["Lalbagh, Bangalore"], "Images": ["White Mulberry Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "Bark", "Branch", "Canopy", "Flower Bud", "Flower", "Fruit New", "Fruit Tender 1", "Fruit Tender 2", "Fruit", "Leaf New", "Leaf Tender", "Leaf"]], "Size": "Small", "Flowers Season": "Mar", "Fruits Color": "red", "Description": "A beatiful, large leaved, naturally well shaped tree that offers dense shade. Grows at about 1 ft/yr to 30 ft. Berries are mildly sweet, reminiscent of watermelon. This is the mulberry used to feed silkworms. Birds love the berries. The white mulberry is so-named for the color of its buds, rather than the color of its fruit. The thin, glossy, light green leaves are variously lobed even on the same plant. Some are unlobed while others are glove-shaped. Leaves of the red mulberry are larger and thicker, blunt toothed and often lobed. Mulberry trees are either dioecious or monoecious, and sometimes will change from one sex to another. The flowers are held on short, green, pendulous, nondescript catkins that appear in the axils of the current season's growth and on spurs on older wood. They are wind pollinated and some cultivars will set fruit without any pollination. Cross-pollination is not necessary. Botanically the fruit is not a berry but a collective fruit. The color of the fruit does not identify the mulberry species. White mulberries, for example, can produce white, lavender or black fruit. The white mulberry is native to eastern and central China.", "Genus": "Morus", "Type": "Tree", "Species": "alba", "Native": "India"}
