{"Leaves Texture": "velvety", "Common Family": "Gulmohar", "Type": "Tree", "Leaflet Numbers": "20 pairs", "Bark Info": "Becomes darker, rougher in older trees", "Description": "Burmese Pink Cassia is an ornamental garden and roadside tree. It is a small tree - not more than 20 feet but in May when the large, showy flowers and tender, green leaves appear, it presents a strikingly beautiful picture, enhanced by the varied tones of pink in each small cluster. These clusters rise on short stems from the scars of the old leaves. At the base of each flower stalk is a bract like a small leaf and these numerous bracts crowded together form a long clump from which spring the downy, red stalks. Outside, the calyx is dull red; inside, the palest green. The flowers, each about 2 inches across are a deep pink when young, but fade almost to white. The ten yellow stamens are in groups of three, four and three, crowned with delicate green anthers. The longest three are curled like the letters \"S\" and have a curious balloon-like swelling in the middle. The leaves, which fall in December, leaving the tree adorned only by the long blackened pods, are up to 1 foot in length. Each bears from eight to twenty pairs of downy oblong leaflets, rounded at the tips. Some identification features of this tree are - flowers have leafy bracts below them; Stipules are 1.5-2.5 cm long, leafy, kidney shaped. Native of dry zone of Upper Burma, now introduced into India. Flowering: May-July.", "Where": ["Lalbagh, Bangalore"], "Grow Type": "Deciduous", "Sub Family": "Caesalpinioideae", "Name": "Burmese Pink Cassia Tree", "Leaves Type": "paripinnate", "Fruits Shape": "Cylinderical pod", "Fruits Size": "60 cm", "Genus": "Cassia", "Flowers Color": "Pink", "Wiki": "http://species.wikimedia.org/wiki/Pink_Shower_Tree", "Bark Color": "dark brown", "Links": ["http://www.flowersofindia.net/catalog/slides/Burmese%20Pink%20Cassia.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?411462", "http://www.theplantlist.org/tpl/record/ild-1103"], "Family": "Fabaceae", "Authority": "(Wall. ex Benth.) K. Larsen", "Flowers Season": "May-Jun", "Bark Texture": "fissured", "Images": ["Burmese Pink Cassia Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "Bark", "Branch", "Canopy", "Flower Bunch", "Flower Single", "Flower", "Fruit", "Leaf"]], "Native": ["S. E. Asia"], "Flowers Info": "vevety bracts near the flower base", "Species": "javanica ssp. renigera", "Size": "Small"}
