{"Leaves Texture": "Leathery", "Common Family": "Mulberry", "Common Sub Family": "Fig", "Where": ["Everywhere, Bangalore"], "Leaves Size": "20 cm", "Bark Info": "exudes milk when cut", "Description": "Barh or Banyan, a remarkable tree of India and tropical Africa sends down from its branches great numbers of shoots, which take root and become new trunks. A single tree thus may spread over a large area and look like a small forest. This tree is considered to be sacred in some places in India. A specimen in the Calcutta botanical garden is more than 100 years old. It has a main trunk 13 feet (4 m) in diameter, 230 trunks as large as oak trees, and more than 3,000 smaller ones. The largest banyan tree known is on the island of Sri Lanka. It has 350 large trunks and over 3,000 small ones. The banyan often grows to a height of over 21 meters and lives through many ages. Perhaps the most amazing part of this extraordinary tree is its flower. What we think of as the fruit is really a hollow, flower-bearing structure called a cyconia. The inside it is lined with hundreds of male and female flowers. The males carry pollen and the females bear seeds. Various parts of this plant are considered medicinal. The bark of this therapeutically valuable tree is attributed with tonic, astringent,cooling and diuretic properties in Ayurveda. A postal stamp was issued by the Indian Postal Department to commemorate this tree.", "Type": "Tree", "Grow Type": "Nearly Evergreen", "Roots Aerial": "thick", "Figs Shape": "Round", "Name": "Banyan Tree", "Leaves Type": "oval", "Bark Texture": "not rough", "Figs Info": "Richly red when ripe. Without stalks, in pairs from leaf axils.", "Figs Season": "Jan-Feb,Jun-Jul", "Genus": "Ficus", "Wiki": "http://en.wikipedia.org/wiki/Banyan", "Bark Color": "Grey", "Figs Texture": "Faintly Downy", "Links": ["http://www.flowersofindia.net/catalog/slides/Banyan%20Tree.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?16783", "http://www.theplantlist.org/tpl/record/kew-2809652"], "Family": "Moraceae", "Locale": {"Sanskrit": ["Vat"], "Tamil": ["Alai"], "Hindi": ["Barh"], "Telugu": ["Marri chettu"]}, "Authority": "L.", "Figs Size": "Large", "Leaves Shape": "heart", "Images": ["Banyan Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "Aerial Root", "Bark", "Canopy", "Fig Falling", "Fig New", "Fig Tender", "Fig", "Leaf New", "Leaf Tender", "Leaf"]], "Native": ["India"], "Species": "Benghalensis", "Size": "Large"}
