{"Common Family": "Cocoa", "Type": "Tree", "Leaflet Numbers": "5-9", "Description": "Java Olive is a tall, straight tree. Originally from East Africa and North Australia, it grows freely down the West of the Peninsular, in Burma Ceylon and South India. The grey bark is smooth, spotted with brown and faintly ridged. The branches are whorled and usually horizontal, the numerous branchlets gracefully up-curved and crowded at the ends with large, palm-like leaves, remind one somewhat of the English Horse-chestnut. The flowers, appearing early in February, form at the knotty ends of the wrinkled old branchlets immediately beneath the new leaves and spread in drooping rays as much as one foot in length. The reddish-green stems bear numerous short branched stalks, each terminating in a crimson-brown flower. The sepals, which look like petals, (there are no visible real petals), are about 1-inch across, back-curling and varying in colour from yellow to pale terracotta and to deep crimson and brown. But the main characteristic of these flowers is their incredible stench. Coming across a Java Olive in bloom ones would think that one was near an open sewer and any part of the tree when bruised or cut emits this unpleasant odour. It is unfortunate as the tree is extremely handsome; tall and straight, its well shaped crown swathed in coral, often without a single touch of green, it stands out amongst the surrounding verdure in great beauty and dignity. The seeds are edible after toasting and taste like chestnuts (Castanea sativa ). They also contain an oil that is used medicinally, while the timber is used for making furniture and the bark for rope.", "Where": ["close to 80ft road, National Games Village, Koramangala, Bangalore"], "Grow Type": "Deciduous", "Name": "Wild Almond Tree", "Leaves Type": "Palmately Compound", "Fruits Shape": "boat shaped", "Fruits Size": "large", "Fruits Color": "green turning scarlet", "Genus": "Sterculia", "Flowers Color": "purply brown", "Wiki": "http://en.wikipedia.org/wiki/Sterculia", "Bark Color": "Pale grey brown", "Links": ["http://www.flowersofindia.net/catalog/slides/Java%20Olive.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?101996", "http://www.theplantlist.org/tpl/record/kew-2579743"], "Family": "Sterculiaceae", "Locale": {"Common": ["Java olive", "Great sterculia", "Skunk tree", "Bastrad poon tree"]}, "Authority": "L.", "Flowers Season": "Jan", "Images": ["Wild Almond Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "Bark Young", "Bark", "Branch", "Canopy Leaf", "Canopy", "Flower Bud", "Flower Single", "Flower", "Fruit Bunch", "Fruit New", "Fruit Seed", "Fruit Tender", "Fruit", "Leaf New", "Leaf Tender", "Leaf"]], "Flowers Shape": "bell", "Native": ["N. Australia"], "Species": "Foetida", "Size": "Large"}
