{"Common Family": "Citrus", "Common Sub Family": "maxima", "Type": "Tree", "Description": "The pomelo is a citrus fruit, usually a pale green to yellow when ripe, larger than a grapefruit, with sweet flesh and thick spongy rind. The largest citrus in the world, the pummelo can reach 12\" in diameter. The pummelo tree may be 16 to 50 ft tall, with a somewhat crooked trunk 4 to 12 in thick, and low, irregular branches. Some forms are distinctly dwarfed. The young branchlets are angular and often densely hairy, and there are usually spines on the branchlets, old limbs and trunk. Technically compound but appearing simple, having one leaflet, the leaves are alternate, ovate, ovate-oblong, or elliptic, 5-20 cm long, 2-12 cm wide, leathery, dull-green, glossy above, dull and minutely hairy beneath. Leaves have a distinctly winged stalk. The flowers are fragrant, borne singly or in clusters of 2 to 10 in the leaf axils, or sometimes 10 to 15 in terminal racemes 4 to 12 in long; rachis and calyx hairy; the 4 to 5 petals, yellowish-white, 1.5-3.5 cm long, somewhat hairy on the outside and dotted with yellow-green glands; stamens white, prominent, in bundles of 4 to 5, anthers orange. The pomelo is native to Southeast Asia and all of Malaysia, and grows wild on river banks in Fiji, Tonga, and Hawaii. It may have been introduced into China around 100 B.C. It is widely cultivated in southern China (Jiangsu, Jiangxi, and Fujian Provinces) and especially in central Thailand on the banks to the Tha Chin River; also in Taiwan and southernmost Japan, southern India, Bangladesh, Myanmar, Vietnam, Malaysia, Indonesia, New Guinea, and Tahiti. The pomelo is also known as a \"shaddock,\" after an English sea captain, Captain Shaddock, who introduced the seed to the West Indies in the 17th century from the Malay Archipelago.", "Where": ["100ft road, next to 7th main road, Indiranagar, Bangalore"], "Grow Type": "Nearly Evergreen", "Name": "Grapefruit Tree", "Leaves Type": "oval", "Fruits Size": "30 cm", "Fruits Color": "green turning orange", "Genus": "Citrus", "Flowers Color": "white", "Wiki": "http://en.wikipedia.org/wiki/Citrus_maxima", "Bark Color": "dark grey", "Links": ["http://www.flowersofindia.net/catalog/slides/Pomelo.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?10744", "http://www.theplantlist.org/tpl/record/kew-2724206"], "Family": "Rutaceae", "Authority": "(Burm.) Merr.", "Height": "6 m", "Flowers Season": "Jan-Feb, Jun-Jul", "Images": ["Grapefruit Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "Bark", "Canopy", "Flower Bud", "Flower", "Fruit Tender 1", "Fruit Tender 2", "Fruit", "Leaf"]], "Species": "maxima", "Size": "Small"}
