{"Common Family": "jasmine", "Type": "Tree", "Fruits Shape": "Pod", "Description": "It is a small, evergreen foliage tree or a large shrub. It reaches a height of four to seven meters. The pale green leaves are long and pointed and about 10-12\" in length. They are of a pleasing pale green color. Planted in good sunlight, the leaves may acquire a light yellow color, which looks nice and unusual. The plant belongs to Nyctaginaceae family of bougainvillea and four o'clock plant. But, unlike the two other family members, is grown not for its flowers but for its leaves. The leaves used by natives as cattle feed. They also have medicinal properties and cooked and eaten when suffering from rheumatism or arthritis. The young leaves come in handy as a leafy vegetable. The lettuce tree can be grown as a large shrub. Being a coastal tree it does not thrive as well on land as it does on the east and west coast of the USA. The plant grows well in any soil, but being a littoral plant it shows preference for sandy soil. It is propagated through cuttings, which root easily in sand. Pisonia alba can be planted singly in large compounds to make it grow into trees or planted closely and trimmed regularly to make a pleasant looking hedge. The tree rarely flowers. The flowers are small, green and inconspicuous. The leaves are also carminative (expels flatulence). Leaves coated with eau de cologne are used to rub on elephantoid swellings.", "Where": ["5th Cross Road, 10th Main Road, II Stage, Indiranagar, Bangalore", "Gangadhar Chetty Road, Ulsoor, Bangalore"], "Grow Type": "Evergreen", "Name": "Lettuce Tree", "Leaves Type": "oval", "Fruits Color": "Green turning greyish", "Genus": "Pisonia", "Flowers Color": "green", "Wiki": "http://en.wikipedia.org/wiki/Pisonia_alba", "Bark Color": "Geyish brown", "Links": ["http://www.flowersofindia.net/catalog/slides/Lettuce%20Tree.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?28638", "http://www.theplantlist.org/tpl/record/tro-22500321"], "Family": "Nyctaginaceae", "Locale": {"Common": ["Lettuce tree", "Cabbage tree", "Hawaiian papala kepau", "Sule sappu", "Lachaikottei"]}, "Flowers Size": "Small", "Authority": "Span.", "Images": ["Lettuce Tree", ["0000", "0001", "Bark", "Canopy", "Leaf Tender", "Leaf"]], "Species": "alba", "Size": "Small"}
