{"Wiki": "http://en.wikipedia.org/wiki/Bauhinia_vahlii", "Bark Color": "green", "Leaflet Numbers": "2", "Common Family": "bauhinia", "Name": "Maloo Creeper", "Family": "Fabaceae", "Leaves Type": "lobed", "Flowers Color": "white", "Grow Type": "Evergreen", "Fruits Shape": "Pod", "Sub Family": "Caesalpinioideae", "Links": ["http://www.flowersofindia.net/catalog/slides/Maloo%20Creeper.html"], "Authority": "L.", "Where": ["Lalbagh, Bangalore"], "Size": "small", "Images": ["Maloo Creeper", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "Bark", "Canopy", "Flower Bud", "Flower Bunch", "Flower", "Fruit", "Leaf New", "Leaf"]], "Description": "Snake Climber is a large, woody liana, gets its name from the snake-like twists of its stem. Another name, monkey-ladder comes from the flattened parts of the stem with indentations that look like steps. Branches are cylindric when young, flattened when old, forming \"monkey ladders. Tendrils occur in pairs, bristly. Leaf stalks are 2-4 cm, slender. Leaves are ovate to broadly ovate, 5-9 × 4-8 cm, papery, both surfaces hairless, primary veins usually 7-9, base shallowly heart-shaped to flat. Leaf tip is entire on flowering branches, and divided into two, up to more than half its length, in sterile or juvenile branches. Lobes have blunt or long-pointed tips. Flowers are borne in elongated raceme, 10-15 cm long, many flowered, or several joined in a panicle 15-25 cm, at the end of branches. Bracts and bracteoles are linear. Flower-stalk is 3-4 mm, slender. Flower buds are ovoid, 1.8-2 mm in diameter, tip open. Flowers have 5 triangular sepals which are velvety on the out­side. Petals are white, nearly equal, obovate to inverted-lanceshaped, about 3 mm, shortly clawed. Fertile stamens are 3, staminodes 2. Flower disk is fleshy, swollen. Ovary shortly is stalked, oblique, hairless, style stout; stigma small. Pod is rhombic to oblong, 1.8-3 × 1-1.6 cm. Seeds are 1 or 2, ellipsoid to obo­void-orbicular, about 8 mm in diameter. Flowering: October.", "Genus": "Bauhinia", "Type": "Climber", "Species": "vahlii", "Native": "India"}
