{"Leaves Texture": "Feathery", "Common Family": "Rudraksh", "Medicinal Uses": "The flowers are said to possess antiseptic properties. An infusion of the flowers is valued as an antispasmodic. It is taken to relieve headache and the first symptoms of a cold.", "Type": "Tree", "Fruits Shape": "berry", "Description": "Jamaica Cherry is a very fast-growing tree of slender proportions, reaching 25 to 40 ft in height, with spreading, nearly horizontal branches. The leaves are evergreen, alternate, lanceolate or ovate, long-pointed at the apex, oblique at the base. The flowers with 5 green sepals and 5 white petals and many prominent yellow stamens last only one day, the petals falling in the afternoon. Flowers resemble strawberry bloom, hence the common name, Strawberry tree. The abundant fruits are round, 1-1.25 cm wide, with red or sometimes yellow, smooth, thin, tender skin and light-brown, soft, juicy pulp, with very sweet, musky, somewhat fig-like flavor, filled with exceedingly minute, yellowish seeds, too fine to be noticed in eating. The tree has the reputation of thriving with no care in poor soils. It is drought-resistant but not salt-tolerant. Wherever it grows, fruits are borne nearly all year. The leaf infusion is drunk as a tea-like beverage. Fruits contain hundreds of tiny seeds.", "Where": ["13th cross road, 6th main road, II stage, indiranagar, Bangalore"], "Grow Type": "Evergreen", "Name": "Jamaica Cherry Tree", "Leaves Type": "ovate", "Fruits Size": "1.25 cm", "Fruits Color": "Green turning red", "Genus": "Muntingia", "Flowers Color": "White", "Wiki": "http://en.wikipedia.org/wiki/Muntingia", "Bark Color": "grey", "Links": ["http://www.flowersofindia.net/catalog/slides/Jamaica%20Cherry.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?24697", "http://www.theplantlist.org/tpl/record/kew-2507614"], "Family": "Elaeocarpaceae", "Locale": {"Common": ["Strawbeery tree"]}, "Authority": "L.", "Height": "25-40 ft", "Flowers Season": "Jan-Mar", "Images": ["Jamaica Cherry Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "Bark", "Canopy", "Flower", "Fruit Tender 1", "Fruit Tender 2", "Fruit", "Leaf Tender", "Leaf"]], "Native": ["Tropical Asia"], "Flowers Info": "5 petals", "Species": "Calabura", "Size": "Small"}
