{"Common Family": "evodia", "Type": "Tree", "Fruits Shape": "unknown", "Description": "A small to medium rainforest tree growing to 25 metres tall and a diameter of 60 cm. The natural range is from the Clarence River (29° S) in New South Wales to tropical northern Australia. It is also found in New Guinea and the Solomon Islands. The Pink Flowered Doughwood is usually found in riverine rainforest areas.  The trunk is almost white, of a doughy appearance, with a thick layer of soft corky dead bark. The trunk is slightly buttressed or flanged at the base.  The opposite leaflets are in threes, mostly ovate. 6 to 13 cm long, tapering to a blunt point at the tip. This tree is the favoured food plant for the spectacular Ulysses butterfly, Papilio ulysses.  Flowers form in a cyme or panicle springing from the old leaf axils. Individual flowers are 3 to 4 cm long, and form from January to March.  The fruit is two to four cell dry cocci. They mature from July to December, spitting down one side exposing a single shiny black flattened seed, 4 to 5 cm long. Germination is unpredictable, starting within 30 days or taking several years. Soaking the seeds for several days appears to remove some of the germination inhibitors.", "Where": ["Lalbagh, Bangalore"], "Grow Type": "Deciduos", "Name": "Pink Doughwood Tree", "Leaves Type": "trifoliate", "Genus": "Melicope", "Flowers Color": "pink", "Wiki": "http://en.wikipedia.org/wiki/Melicope_elleryana", "Bark Color": "grey", "Links": ["http://www.flowersofindia.net/catalog/slides/", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?464011", "http://www.theplantlist.org/tpl/record/tro-50261856"], "Family": "Rutaceae", "Authority": "(F. Muell.) T.G. Hartley", "Height": "25", "Flowers Season": "Jul-Aug", "Images": ["Pink Doughwood Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "Bark", "Branch", "Canopy", "Flower Bunch", "Flower", "Fruit Falling", "Fruit New", "Fruit", "Leaf"]], "Flowers Shape": "panicle", "Native": ["Australia"], "Species": "elleryana", "Size": "Small"}
