{"Common Family": "Mahua", "Where": ["Near meera school, ulsoor, Bangalore"], "Leaves Size": "7-15 cm", "Fruits Shape": "egg", "Bark Info": "Exudes milk when cut", "Description": "Chikoo is a fairly slow-growing, long-lived tree, upright and elegant, distinctly pyramidal when young. It grows up to to 18 m high in the open but reaching 30 m when crowded in a forest. It is strong and wind-resistant, rich in white, gummy latex. Its leaves are highly ornamental, evergreen, glossy, alternate, spirally clustered at the tips of the forked twigs; elliptic, pointed at both ends, firm, 7.5-11.25 cm long and 2.5-4 cm wide. Flowers are small and bell-like, with 3 brown-hairy outer sepals and 3 inner sepals enclosing the pale-green corolla and 6 stamens. They are borne on slender stalks at the leaf bases. The fruit may be nearly round, oblate, oval, ellipsoidal, or conical; varies from 2 to 4 in 5-10 cm in width. When immature it is hard, gummy and very astringent. Though smooth-skinned it is coated with a sandy brown scurf until fully ripe. The flesh ranges in color from yellowish to light- or dark-brown or sometimes reddish-brown; may be coarse and somewhat grainy or smooth; becomes soft and very juicy, with a sweet flavor resembling that of a pear. Some fruits are seedless, but normally there may be from 3 to 12 seeds which are easily removed as they are loosely held in a whorl of slots in the center of the fruit. They are brown or black, with one white margin; hard, glossy; long-oval, flat, with usually a distinct curved hook on one margin; and about 2 cm long.", "Type": "Tree", "Grow Type": "Evergreen", "Language Common": "Sapodilla plum, Noseberry", "Language Hindi": "Chikoo", "Name": "Chikoo Tree", "Leaves Type": "oval", "Fruits Size": "6-10 cm", "Fruits Color": "brown", "Genus": "Manilkara", "Flowers Color": "pale green", "Wiki": "http://en.wikipedia.org/wiki/Manilkara_zapota", "Bark Color": "Brown or greyish", "Links": ["http://www.flowersofindia.in/catalog/slides/Chikoo.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?102614", "http://www.theplantlist.org/tpl/record/kew-120271"], "Family": "Sapotaceae", "Language Tamil": "Chappotta", "Flowers Size": "small", "Authority": "(L.) P.Royen", "Flowers Season": "Jan-Mar", "Bark Texture": "not rough", "Images": ["Chikoo Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "Bark", "Branch", "Canopy", "Flower Bud", "Flower", "Fruit", "Leaf"]], "Flowers Shape": "bell like", "Native": "India", "Species": "Zapota", "Size": "Large"}
