{"Common Family": "Palm", "Where": ["100 ft road, near CMH road, I Stage, Indiranagar, Bangalore"], "Leaves Size": "2 m", "Fruits Shape": "olive like", "Description": "Borassus flabellifer, the Asian Palmyra palm, Toddy palm, Sugar palm, or Cambodian palm, is native to South and Southeast Asia, in the Indomalaya ecozone. It is palm tree, one of the Sugar palm group, found from Indonesia to Pakistan. The palmyra palm is a large tree up to 30m high and the trunk may have a circumference of 1.7m at the base. There may be 25-40 fresh leaves. Leaves are leathery, gray green, fan-shaped, 1-3 m wide, folded along the midrib; are divided to the center into 60-80 linear- lanceolate, 0.6-1.2 m long, marginally spiny segments. Their strong, stalks, 1-1.2 m long, are edged with hard spines. In India, it is planted as a windbreak on the plains. It is also used as a natural shelter by birds, bats and wild animals. The flowers are produced in big clusters of long, white string-like inflorences. The coconut-like fruits are three-sided when young, becoming rounded or more or less oval, 12-15 cm wide, and capped at the base with overlapping sepals. When the fruit is very young, this kernel is hollow, soft as jelly, and translucent like ice, and is accompanied by a watery liquid, sweetish and potable. The chief product of the palmyra is the sweet sap (toddy) obtained by tapping the tip of the inflorescence, as is done with the other sugar palms and, to a lesser extent, with the coconut. The toddy ferments naturally within a few hours after sunrise and is locally popular as a beverage. Rubbing the inside of the toddy-collecting receptacle with lime paste prevents fermentation, and thereafter the sap is referred to as sweet toddy, which yields concentrated or crude sugar (gur in India; jaggery in Ceylon); molasses, palm candy, and vinegar. Palmyra palm jaggery (gur) is much more nutritious than crude cane sugar. Traditionally, the Indian 'Nadar' community are the people who make their living from this tree using its wood, fruits, sap, stems, petioles and leaves to process a variety of food products, beverages, furniture, building materials, and handicrafts.", "Type": "Tree", "Grow Type": "Evergreen", "State Tree": "Tamil Nadu", "Language Common": "African fan palm, borassus palm, doub palm, great fan palm, lontar palm, ron palm, tala palm, tal-palm, toddy palm, wine palm", "Name": "Palmyra Palm Tree", "Leaves Type": "fan", "Fruits Color": "yellow brown to black or purple", "Genus": "Borassus", "Flowers Color": "Yellow", "Wiki": "http://en.wikipedia.org/wiki/Borassus_flabellifer", "Bark Color": "dark", "Links": ["http://www.flowersofindia.in/catalog/slides/Palmyra%20Palm.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?7425", "http://www.theplantlist.org/tpl/record/kew-23006"], "Family": "Arecaceae", "Authority": "L.", "Height": "30 m", "Flowers Season": "Mar-Apr", "Images": ["Palmyra Palm Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "Bark", "Canopy", "Flower", "Fruit", "Leaf Falling", "Leaf"]], "Flowers Shape": "ovoid", "Native": "South East Asia", "Species": "flabellifer", "Size": "Large"}
