{"Common Family": "Mahua", "Authority": "(Roxb.) A. Chev.", "Type": "Tree", "Fruits Shape": "olive like", "Description": "Mohwa is one of the most important of Indian forest trees, not because it may possess valuable timber - and it is hardly ever cut for this purpose - but because of its delicious and nutritive flowers. It is a tree of abundant growth and, to the people of Central India, it provides their most important article of food as the flowers can be stored almost indefinitely. It is large and deciduous with a thick, grey bark, vertically cracked and wrinkled. Most of the leaves fall from February to April, and during that time the musky-scented flowers appear. They hang in close bunches of a dozen or so from the end of the gnarled, grey branchlets. Actually the word ‘hang’ is incorrect because, when a bunch is inverted, the flower stalks are sufficiently rigid to maintain their position. These stalks are green or pink and furry, about 5 cm. long. The plum-coloured calyx is also furry and divides into four or five lobes; within them lies the globular corolla, thick, juicy and creamy white. Through small eyelet holes at the top, the yellow anthers can be seen. The stamens are very short and adhere to the inner surface of the corolla; the pistil is a long, protruding green tongue. It is at night that the tree blooms and at dawn each short-lived flower falls to the ground. A couple of months after the flowering period the fruit opens. They are fleshy, green berries, quite large and containing from one to four shiny, brown seeds.", "Where": ["Lalbagh, Bangalore"], "Grow Type": "Semi Evergreen", "Name": "Mahua Tree", "Leaves Type": "oval", "Fruits Color": "green", "Genus": "Madhuca", "Flowers Color": "creamish", "Wiki": "http://en.wikipedia.org/wiki/Madhuca_latifolia", "Bark Color": "grey brown", "Links": ["http://www.flowersofindia.in/catalog/slides/Mahua.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?452025", "http://www.theplantlist.org/tpl/record/kew-117251"], "Family": "Sapotaceae", "Medicinal Uses": "Medicinally the tree is very valuable. The bark is used to cure leprosy and to heal wounds, tne flowers are prepared to relieve coughs, biliousness and heart-trouble while the fruit is given in cases of consumption and blood diseases.", "Flowers Season": "Feb-Mar", "Images": ["Mahua Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "0024", "0025", "0026", "Bark", "Canopy Leaf", "Canopy", "Flower Bud 1", "Flower Bud 2", "Flower", "Fruit New", "Fruit Tender", "Fruit", "Leaf New", "Leaf Tender", "Leaf"]], "Native": "India", "Species": "longifolia var. latifolia", "Size": "Medium"}
