{"Common Family": "sugar apple family", "Where": ["Lalbagh, Bangalore"], "Leaves Size": "15 cm", "Fruits Shape": "round", "Description": "The Soursop (Annona muricata) is a broadleaf, flowering, evergreen tree native to Mexico, Cuba, Central America, the Caribbean and northern South America: Colombia, Brazil, Peru, and Venezuela. Soursop is also native to sub-Saharan African countries that lie within the tropics. Today, it is also grown in some areas of Southeast Asia. It was most likely brought from Mexico to the Philippines by way of the Manila-Acapulco galleon trade.[citation needed] It is in the same genus as the chirimoya and the same family as the pawpaw.  Soursop fruit The soursop is adapted to areas of high humidity and relatively warm winters; temperatures below 5 °C (41 °F) will cause damage to leaves and small branches, and temperatures below 3 °C (37 °F) can be fatal. The fruit becomes dry and is no longer good for concentrate.  Annona muricata var.subonica Other common names include: guanábana (Spanish), graviola (Portuguese), Brazilian pawpaw, guyabano, corossolier, guanavana, toge-banreisi, durian benggala, nangka blanda, sirsak, and nangka londa.[2] In Malayalam, it is called mullaatha, literally thorny custard apple. The other lesser known Indian names are shul-ram-fal and hanuman fal. In Sri Lankan mythology, Lord Rama and his disciple Hanuman are believed to have consumed this fruit on their way to Lanka.  Its flavor has been described as a combination of strawberry and pineapple with sour citrus flavor notes contrasting with an underlying creamy flavor reminiscent of coconut or banana.", "Type": "Tree", "Grow Type": "Deciduous", "Fruits Info": "Edible", "Name": "Soursop Tree", "Leaves Type": "oval", "Genus": "Annona", "Flowers Color": "Yellow Green", "Species": "muricata", "Wiki": "http://en.wikipedia.org/wiki/Soursop", "Bark Color": "Greyish", "Links": ["http://www.flowersofindia.net/catalog/slides/", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?3492", "http://www.theplantlist.org/tpl/record/kew-2640944"], "Family": "Annonaceae", "Authority": "L.", "Height": "10-12m", "Flowers Season": "Aug-Nov", "Leaves Shape": "oblong", "Images": ["Soursop Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "Bark", "Canopy", "Flower Bud", "Flower", "Fruit Tender", "Fruit", "Leaf"]], "Native": ["South America"], "Flowers Info": "3 petals", "Leaves Arrangement": "Alternate", "Size": "Small"}
