{"Leaves Texture": "Feathery", "Common Family": "Jacaranda", "Leaves Stalks": "3-5 pairs", "Type": "Tree", "Leaflet Numbers": "2-3", "Bark Info": "Scaly and craked on ageing", "Description": "Indian Cork Tree is cultivated in most parts of India, both in gardens and avenues. Tall and straight, with comparatively few branches, its popularity lies in its ornamental value. It is a fine tree, fast growing, but with brittle wood, liable to be damaged by storms. In favourable positions it can grow to 24 m tall. The ashy bark is cracked and furrowed and the numerous fissures make removal of the cork an easy matter. It is used as an inferior substitute for true cork. From April until the rains and again in November and December, a profusion of silvery-white, delightfully fragrant flowers crown the foliage. Upright open clusters with arching blooms terminate every branchlet. Each flower is a tiny bell-shaped calyx, a long slender tube of palest green dividing into four waxy, white petals and several conspicuous yellow anthered stamens. Many flowers are delicately tinted with rose. As the flowers are short-lived, the flower sprays mostly consist largely of long whitish buds, while the ground below is spangled with innumerable little stars. Between January and March the leaves are shed and renewed during April and May, although the tree is never quite naked. The long leaves bear two or three widely spaced pinnae, each with five or seven smooth leaflets, oval, pointed and slightly round-toothed. Each is from 2.5 to 7.5 cm. long. Sometimes the lower pinnae, are again divided and bear one pair of three leaved pinnae, one or two pairs of leaflets and one leaflet at the end. The fruit is very long and narrow, pointed at both ends and contains thin flat seeds. Trees do not seed very easily in India. The long, fragrant flowers are commonly woven into an ornamental braid called Veni in Maharashtra.", "Where": ["National Games Village, Koramangala, Bangalore", "Indiranagar Sangeethasabha, Indiranagar, Bangalore"], "Grow Type": "deciduous", "Name": "Indian Cork Tree", "Leaves Type": "2-3 pinnate", "Fruits Shape": "Pod", "Fruits Size": "35 cm", "Fruits Color": "green to brown", "Genus": "Millingtonia", "Flowers Color": "pure White", "Wiki": "http://en.wikipedia.org/wiki/Millingtonia", "Bark Color": "Yellowish Grey", "Links": ["http://www.flowersofindia.net/catalog/slides/Indian%20Cork%20Tree.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?24326", "http://www.theplantlist.org/tpl/record/kew-317516"], "Family": "Bignoniaceae", "Locale": {"Common": ["Tree jasmine"]}, "Authority": "L.f.", "Height": "18-25 m", "Flowers Season": "Sep-Nov", "Bark Texture": "Scaly", "Images": ["Indian Cork Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "0014", "0015", "0016", "0017", "0018", "0019", "0020", "0021", "0022", "0023", "0024", "Bark", "Canopy Top", "Canopy", "Flower Bud 1", "Flower Bud 2", "Flower Mat", "Flower Single", "Flower", "Fruit Tender 1", "Fruit Tender 2", "Fruit", "Leaf New", "Leaf Tender", "Leaf"]], "Native": ["S. E. Asia"], "Species": "Hortensis", "Size": "Medium"}
