{"Wiki": "http://en.wikipedia.org/wiki/House_Sparrow", "Name": "House Sparrow", "Family": "Passeridae", "Where": ["Everywhere"], "Authority": "L.", "Images": ["House Sparrow", ["0000", "0001", "0002", "Female", "Male"]], "Description": "The House Sparrow is a chunky bird,[3] typically about 16 centimetres (6.3 in) long, ranging from 14–18 centimetres (5.5–7.1 in).[4] It has a large rounded head, a short tail, and a stout bill.[3] In weight, the House Sparrow ranges from 24–39.5 grams (0.85–1.39 oz). Weight varies by sex, with females usually smaller than males. The median weight on the European continent for both sexes is about 30 grams (1.1 oz), and in more southerly subspecies is around 26 grams (0.92 oz). Younger birds are smaller, males are larger during the winter, and females are larger during the breeding season.[5] Between and within subspecies, there is further variation based on latitude, altitude, climate, and other environmental factors, under biological rules such as Bergmann's rule. The plumage of the House Sparrow is mostly different shades of grey and brown. The sexes differ: the female is mostly buff, and the male has bolder markings and a reddish back.[7] The male has a dark grey crown from the top of its bill to its back, and chestnut brown on the sides of its head. It has black around its bill, on its throat, and on the spaces between its bill and eyes (lores). It has a small white stripe between the lores and crown and small white spots immediately behind the eyes (postoculars), with black patches below and above them. The underparts are pale grey or white, as are the cheeks, ear coverts, and stripes at the base of the head. The upper back and mantle are a warm brown, with broad black streaks, while the lower back, rump and uppertail coverts are greyish-brown.[9] The male is duller in fresh non-breeding plumage, with whitish tips on many feathers. Wear and preening expose many of the bright brown and black markings, including most of the black throat and chest patch, called the \"bib\" or \"badge\".[10] The badge is variable in width and general size, and some scientists have suggested that patches signal social status or fitness, a hypothesis which has led to a \"veritable 'cottage industry'\" of studies, which have only conclusively shown that patches increase in size with age.[11] The female has no black on head or throat, nor a grey crown, and its upperparts are streaked with brown. The juvenile is similar to the female but deeper brown, and the white is replaced by buff; its beak is pink to dull yellow. There is some variation in the twelve subspecies of House Sparrow. The subspecies are divided into two groups, the Oriental indicus group, and the Palaearctic domesticus group. Birds of the domesticus group have grey cheeks, while indicus group birds have white cheeks, as well as bright colouration on the crown, a smaller bill, and a longer black bib.[12] The subspecies Passer domesticus tingitanus differs little from the nominate subspecies, except in the worn breeding plumage of the male, in which the head is speckled with black and underparts are paler.[13] P. d. balearoibericus is slightly paler than the nominate but darker than P. d. bibilicus.[14] P. d. bibilicus is paler than most subspecies, but has the grey cheeks of domesticus group birds. The similar P. d. persicus is paler and smaller, and P. d. niloticus is nearly identical but smaller.[13] Of the less widespread indicus group subspecies, P. d. hyrcanus is larger than P. d. indicus, P. d. hufufae is paler, P. d. bactrianus is larger and paler, and P. d. parkini is larger and darker with more black on the breast than any other subspecies. The House Sparrow can be confused with a number of other seed-eating birds, especially its relatives in the genus Passer. Many of these relatives are smaller, with an appearance that is neater or \"cuter\", as with the Dead Sea Sparrow.[17] The dull-coloured female often can not be distinguished from other birds, and is nearly identical to the females of the Spanish Sparrow and Italian Sparrow.[9] The Eurasian Tree Sparrow is smaller and more slender with a chestnut crown and a black patch on each cheek.[18] The male Spanish Sparrow and Italian Sparrow are distinguished by their chestnut crowns. The Sind Sparrow is very similar but smaller, with less black on the male's throat and a distinct pale supercilium on the female.[9]", "Genus": "Passer", "Type": "Bird", "Species": "domesticus", "Native": "South Asia, Eurasia, Australasia"}
