{"Common Family": "Casuarina", "Type": "Tree", "Fruits Shape": "Cone", "Description": "Whistling Pine is a common tropical seashore tree and is often planted as a windbreak. Whistling Pine has a conifer-like appearance which is increased by hanging green branchlets and cone-like fruits. The species name equisetifolia refers to the resemblence of the leaves to a horse's tail. The soft singing of the air through its innumerable slender twigs is a pleasant sound, which lends it the common name Whistling Pine. It is a large vase-shaped tree that grows 100-150 ft in height with wispy grey green twigs reminiscent of pine needles. The weeping branchlets look a little like jointed rushes and are ringed at their nodes by tightly overlapping little scalelike leaves. The stout trunk is covered with thick pebbly textured brownish grey bark. The male flowers are borne in slender cylindrical spikes at the twig tips. The tiny brownish red female flowers grow in heads attached to the branchlets and are followed by 0.5 in diameter fruits that resemble pinecones and contain 70-90 winged seeds each. The wood is hard and is almost unworkable by carpenters. It also cracks and splits easily and so is more suitable for beams or posts than planks, but does not last long underground. The chief use is as fuel for which a tree may be cut when 10 to 12 years old, although it is better left until about 20.", "Grow Type": "Evergreen", "Name": "Whistling Pine Tree", "Leaves Type": "needle", "Fruits Size": "2 cm", "Fruits Color": "brown", "Genus": "Casuarina", "Where": ["Behind Shiridi Sai Baba Temple, Ulsoor, Bangalore", "Opposite, Meera School, Cambridge Road, Ulsoor, Bangalore"], "Wiki": "http://en.wikipedia.org/wiki/Casuarina_equisetifolia", "Bark Color": "dark brown", "Links": ["http://www.flowersofindia.net/catalog/slides/Whistling%20Pine.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?9553", "http://www.theplantlist.org/tpl/record/kew-2705446"], "Family": "Casuarinaceae", "Locale": {"Common": ["Casuarina", "Common ironwood", "Beefwood", "Bull-oak"]}, "Flowers Size": "red", "Authority": "L.", "Height": "6-35m", "Flowers Season": "Sep-Oct", "Images": ["Whistling Pine Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "Bark", "Canopy", "Flower Bunch", "Flower Male", "Flower", "Fruit Ripe", "Fruit", "Leaf"]], "Native": ["Tropical Africa", "Asia", "N. Australia"], "Species": "Equisetifolia", "Size": "Large"}
