{"Common Family": "Pine", "Authority": "Sarg.", "Leaves Size": "20-32 cm", "Bark Info": "large plates", "Description": "Among the principal pines found in India, chir pine is the most important. Native to the Himalayas, it is good as a street tree too. This is one of the least exacting of the Himalayan trees growing sometimes on bare rocks where only a few species are capable of existing. It is a resinous tree capable of yielding resin continuously provided rill method of tapping is adopted. Erect, round-headed evergreen tree with one or more trunks. Grows at moderate rate to 30 ft., with spread of 20 ft at maturity. The bark is red-brown, thick and deeply fissured at the base of the trunk, thinner and flaky in the upper crown. The leaves are needle-like, in fascicles of three, very slender, 20-35 cm long, and distinctly yellowish green. The flowers are monoecious (individual flowers are either male or female, but both sexes can be found on the same plant) and are pollinated by wind. The cones are ovoid conic, 12-24 cm long and 5-8 cm broad at the base when closed, green at first, ripening glossy chestnut-brown when 24 months old. They open slowly over the next year or so.", "Type": "Tree", "Grow Type": "semi deciduos", "Name": "Chir Pine Tree", "Leaves Type": "needle", "Cones Season": "Feb-Apr", "Genus": "Pinus", "Where": ["1st Cross Road, 6th Main Road, II Stage, Indiranagar, Bangalore"], "Wiki": "http://en.wikipedia.org/wiki/Pinus_roxburghii", "Bark Color": "Grey", "Links": ["http://www.flowersofindia.net/catalog/slides/Chir%20Pine.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?28538", "http://www.theplantlist.org/tpl/record/kew-2562199"], "Family": "Pinaceae", "Locale": {"Common": ["Chir pine", "Himalayan longleaf pine", "Chir"]}, "Medicinal Uses": "The turpentine obtained from the resin of all pine trees is antiseptic, diuretic, rubefacient and vermifuge. It is a valuable remedy used internally in the treatment of kidney and bladder complaints and is used both internally and as a rub and steam bath in the treatment of rheumatic affections. It is also very beneficial to the respiratory system and so is useful in treating diseases of the mucous membranes and respiratory complaints such as coughs, colds, influenza and TB. Externally it is a very beneficial treatment for a variety of skin complaints, wounds, sores, burns, boils etc and is used in the form of liniment plasters, poultices, herbal steam baths and inhalers. The wood is diaphoretic and stimulant. It is useful in treating burning of the body, cough, fainting and ulcers", "Cones Size": "10-20cm", "Cones Color": "brown", "Images": ["Chir Pine Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "Bark", "Canopy", "Cone Ripe", "Cone Tender", "Cone", "Leaf Tender", "Leaf"]], "Native": ["India"], "Species": "roxburghii", "Size": "Large"}
