{"Wiki": "http://en.wikipedia.org/wiki/Duabanga_grandiflora", "Bark Color": "grey", "Fruits Shape": "cone", "Common Family": "Crape Myrtle", "Name": "Duabanga Tree", "Family": "Lythraceae", "Leaves Type": "oval", "Flowers Color": "white", "Grow Type": "Evergreen", "Links": ["http://www.flowersofindia.net/catalog/slides/Duabanga.html", "http://www.ars-grin.gov/cgi-bin/npgs/html/taxon.pl?14730", "http://www.theplantlist.org/tpl/record/kew-2778788"], "Authority": "(Roxb. ex DC.) Walp.", "Where": ["Near Glass House, Lalbagh, Bangalore"], "Images": ["Duabanga Tree", ["0000", "0001", "0002", "0003", "0004", "0005", "0006", "0007", "0008", "0009", "0010", "0011", "0012", "0013", "Bark", "Canopy", "Flower Bud", "Flower", "Fruit Tender", "Fruit", "Leaf New", "Leaf Tender", "Leaf"]], "Size": "Large", "Flowers Season": "Jan-Feb, Oct-Nov", "Fruits Color": "green to black", "Description": "Duabanga is a tall deciduous fast growing tree, indigenous to the Eastern Himalayas. So it is found in the NE states of India. The genus name Duabanga was coined by Francis Hamilton from the vernacular name in Tripura, Duyabangga. The trunk is erect, 40-80 feet high, undivided but sometimes forking from the base. The lower limbs spread drooping from the trunk; these are long, slender, sparingly branched, and the branches are four-angled, loosely covered with large spreading leaves. The leaves are oppositely arranged, red when young, horizontal in two rows, one on each side of the branch, oblong in shape, shining above, dull beneath, over 25 cm long and 10 cm broad. Flowers come out in panicles in leaf axils and at the end of branches. Each flower is large, 5-6 cm across, white in color and ill-smelling. The sepal structure is very thick, bell-shaped and persistent. The 6 petals fall off soon. Stamens are many. The fruit is a more or less rounded, leathery capsule, about the size of a small orange. This tree of often seen along the banks of streams in Assam and Sikkim.", "Genus": "Duabanga", "Type": "Tree", "Species": "grandiflora", "Native": ["India"]}
